/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: suozkara <suozkara@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/08 14:03:37 by suozkara          #+#    #+#             */
/*   Updated: 2024/10/17 17:09:23 by suozkara         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


int ft_isalnum(int c){

if ((c >= 48 && c<= 57) || (c>=65 && c<= 90)  || (c>=97 && c <=122))
{
	return 1;
}
return 0;
}
// 48&57 aralıgı 0-9 
//65&90 aralığı A-Z
//97&122 aralığı a-z
// bu fonksiyon isalpha ve ildigit birlesimidir